{
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "embed_tokens",
    "lm_head"
  ],
  "peft_type": "LORA",
  "r": 8,
  "target_modules": ["q_proj", "k_proj", "v_proj", "gate_proj", "up_proj", "down_proj"],
  "init_lora_weights": "gaussian",
  "task_type": "CAUSAL_LM"
}